<template>
  <scroll-view
    class="container"
    scroll-y
    style="height: 100%; width: 100%"
    :show-scrollbar="false"
  >
    <view class="content">
      <!-- 标题 -->
      <text class="title">梦幻AI秀图用户协议</text>
      <h1>一、使用规范</h1>
      <view class="paragraph">
        1.1使用本服务时请您确保您所输入的内容未侵害他人权未涉及不良信息及情色内容，同时未输入与政治相关的内容，且所有输入内容均合法合规。
      </view>
      <view class="paragraph">
        1.2若平台发现您故意输入1.1中所含的内容，引导AI生成不良内容并进行传播造谣，对公司造成影影响，我们有权对您的账号进行永久封禁并追究相关法律责任。
      </view>
      <view class="paragraph">
        1.3若平台发现您故意输入1.1中所含的内容，引导AI生成不良内容并进行传播造谣，对公司造成影响，我们有权对您的账号进行永久封禁并追究相关法律责任。
      </view>
      <view class="paragraph">
        1.4我们的服务来自于法律法规允许的范围，包括但不限于公开互联网等信息积累，并已经过不断的自动及人工敏感数据过滤，但仍不排除其中部分信息具有瑕疵、不合理或引发不快的问题存在。
      </view>

      <h1>二、本协议内容，生效、变更</h1>
      <view class="paragraph">
        本协议内容包括协议正文及所有本小程序已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。如您对协议有任何疑问亚向本小程序咨询。您在同意所有协议条款并完成注册程序能成为本站的正式用户，您点击”同意并接受”按钮后，本协义即生效，对双方产生约束力。
        只要您使用本小程序平台服务，则本协议即对您产生约束届时您不应以未阅读本协议的内容或者未获得本小程序对您问询的解答等理由，主张本协议无效，或要求撤销本协议。您确人:本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。您承诺接支并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用本小程序平台服务。本小程序有权很据需要不定期地制订、修改本协议及，或各类规则，并在本小程序平台公示，不再另行单独通知用户。变更后的协议和规则一经在网站公布，立即生效。如您不同意相关变更，应当立即停止使用本小程序平台服务。您继续使用本小程序平台服务的，即表明您接受修订后的协议和规则。
        注册资格用户须具有法定的相应权利能力和行为能力的自然法人或其他组织，能够独立承担法律责任。您完成注册程多或其他本小程序平台同意的方式实际使用本平台服务时，即现为您确认自己具备主体资格，能够独立承拍法律责任。若因您不具备主体资格，而导致的一切后果，由您及您的监护人自承担。
      </view>
      <!-- <view class="paragraph">
        3.1用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相立责任及后果，并且本小程序保留终止用户使用本平台各项服务的权利。
      </view>
      <view class="paragraph">
        3.2用户在本站进行浏览等活动时，如果涉及用户真实姓名名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或律另有规定，本站不会句外界披委用户隐私信息
      </view> -->

      <!-- 更多条款内容 -->

      <!-- 签名和日期 -->
      <!-- <text class="signature">本协议签署人：[您的公司名称]</text>
      <text class="date">日期：[签署日期]</text> -->
    </view>
  </scroll-view>
</template>

<style>
.container {
  padding: 20rpx;
}

.content {
  font-size: 16px;
  line-height: 1.5;
}

.title {
  font-size: 24px;
  font-weight: bold;
  margin-bottom: 20rpx;
}

.section {
  font-size: 18px;
  font-weight: bold;
  margin-top: 20rpx;
}

.paragraph {
  margin-top: 10rpx;
}

.signature {
  margin-top: 20rpx;
}

.date {
  margin-top: 10rpx;
}
</style>
